---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.ConceptualConstructionType
source: html/84dcd7a3-a591-ded2-0aa4-84d9efa793a8.htm
---
# ConceptualConstructionType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.